/**
******************************************************************************
*文件：WatchDag.h
*作者：叶依顺
*版本：2.0
*日期：2013-06-17
*概要：独立看门狗类的头文件
*备注：
*
******************************************************************************  
*/ 

	
/* 定义防止递归包含的控制宏----------------------------------------------------*/
#ifndef _WATCH_DOG_H_
#define _WATCH_DOG_H_
/* 头文件包含 ------------------------------------------------------------------*/
#include <stm32f10x.h>
#include <stdlib.h>		
/* 类型定义 --------------------------------------------------------------------*/

/* 宏定义-----------------------------------------------------------------------*/ 
//串口工作模式宏

class WatchDag
{
public:	
	WatchDag();
	~WatchDag();
	static void feedDog();
	static void init();
	static bool getStatus();
	static void clearFlag(){RCC_ClearFlag();}
private:	

};
#endif /*_WATCH_DOG_H_*/


















